
## :white_check_mark: Apply Succeeded (sendgrid-data-cdk-dev)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/16967)



<pre><code>Apply complete! Resources: 1 added, 1 changed, 1 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
data.archive_file.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_lambda-default-file_146ED7F9: Reading...
data.archive_file.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_lambda-default-file_146ED7F9: Read complete after 0s [id=2b764d3b21b3c9f088f043bc205556d3519be551]
data.aws_route53_zone.apigateway-lambda_sendgrid-data-apigateway-lambda_base-dns_main_hosted_zone_5A756590: Reading...
aws_route53_zone.apigateway-lambda_sendgrid-data-apigateway-lambda_base-dns_subhosted_zone_4DA9F733: Refreshing state... [id=Z087040334NE8PGMB8N3C]
data.aws_iam_policy_document.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_lambda-code-deploy_code-deploy-assume-role-policy-document_1C73177E: Reading...
data.aws_kms_alias.pocket-shared-vpc_secrets_manager_key_1721F04F: Reading...
data.aws_ssm_parameter.apigateway-lambda_sentry-dsn_52D8BA00: Reading...
data.aws_caller_identity.pocket-shared-vpc_current_identity_C10C97A4: Reading...
data.aws_region.pocket-shared-vpc_current_region_847136C5: Reading...
data.aws_ssm_parameter.pocket-shared-vpc_private_subnets_899B1172: Reading...
aws_api_gateway_rest_api.apigateway-lambda_api-gateway-rest_FD4A1018: Refreshing state... [id=yz6x5li9y0]
data.aws_iam_policy_document.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_lambda-code-deploy_code-deploy-assume-role-policy-document_1C73177E: Read complete after 0s [id=4250039221]
data.aws_iam_policy_document.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_execution-policy-document_BD5C86F3: Reading...
data.aws_region.pocket-shared-vpc_current_region_847136C5: Read complete after 0s [id=us-east-1]
data.aws_ssm_parameter.pocket-shared-vpc_public_subnets_ED078BA3: Reading...
data.aws_iam_policy_document.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_execution-policy-document_BD5C86F3: Read complete after 0s [id=1465315667]
data.aws_caller_identity.pocket-shared-vpc_current_identity_C10C97A4: Read complete after 0s [id=410318598490]
data.aws_iam_policy_document.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_assume-policy-document_B4DECBDC: Reading...
aws_codedeploy_app.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_lambda-code-deploy_code-deploy-app_4D0EC70B: Refreshing state... [id=c4289a05-c93d-4432-8bf2-659679caa806:SendGridData-Dev-ApiGateway-Lambda]
data.aws_iam_policy_document.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_assume-policy-document_B4DECBDC: Read complete after 0s [id=1349007126]
aws_s3_bucket.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_code-bucket_18555683: Refreshing state... [id=pocket-sendgriddata-dev-apigateway]
aws_acm_certificate.apigateway-lambda_sendgrid-data-apigateway-lambda_api-gateway-certificate_997CB9AA: Refreshing state... [id=arn:aws:acm:us-east-1:410318598490:certificate/d291e1a6-f4ef-4986-b6f5-cc5a3a618fc0]
data.aws_kms_alias.pocket-shared-vpc_secrets_manager_key_1721F04F: Read complete after 0s [id=arn:aws:kms:us-east-1:410318598490:alias/aws/secretsmanager]
data.aws_ssm_parameter.pocket-shared-vpc_vpc_ssm_param_71599A98: Reading...
data.aws_ssm_parameter.pocket-shared-vpc_public_subnets_ED078BA3: Read complete after 0s [id=/Shared/PublicSubnets]
data.aws_ssm_parameter.apigateway-lambda_service-hash_CB1C89E3: Reading...
data.aws_ssm_parameter.pocket-shared-vpc_private_subnets_899B1172: Read complete after 0s [id=/Shared/PrivateSubnets]
aws_iam_role.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_lambda-code-deploy_code-deploy-role_9E2AE32B: Refreshing state... [id=SendGridData-Dev-ApiGateway-CodeDeployRole]
data.aws_ssm_parameter.pocket-shared-vpc_vpc_ssm_param_71599A98: Read complete after 1s [id=/Shared/Vpc]
data.aws_ssm_parameter.apigateway-lambda_sentry-dsn_52D8BA00: Read complete after 1s [id=/SendGridData/Dev/SENTRY_DSN]
aws_iam_policy.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_execution-policy_77491FAA: Refreshing state... [id=arn:aws:iam::410318598490:policy/SendGridData-Dev-ApiGateway-ExecutionRolePolicy]
aws_iam_role.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_execution-role_CCB05633: Refreshing state... [id=SendGridData-Dev-ApiGateway-ExecutionRole]
data.aws_ssm_parameter.apigateway-lambda_service-hash_CB1C89E3: Read complete after 1s [id=/SendGridData/CircleCI/Dev/SERVICE_HASH]
data.aws_vpc.pocket-shared-vpc_405D247E: Reading...
aws_api_gateway_resource.apigateway-lambda_sendgrid-data-apigateway-lambda_events_2B884204: Refreshing state... [id=r0dngj]
aws_route53_record.apigateway-lambda_sendgrid-data-apigateway-lambda_api-gateway-certificate_certificate_record_9F660571: Refreshing state... [id=Z087040334NE8PGMB8N3C__a619665826c77afdc4164923662d6617.sendgrid-data.getpocket.dev._CNAME]
aws_api_gateway_method.apigateway-lambda_sendgrid-data-apigateway-lambda_events-method_CADF1EB7: Refreshing state... [id=agm-yz6x5li9y0-r0dngj-POST]
aws_codedeploy_deployment_group.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_lambda-code-deploy_code-deployment-group_2C886C54: Refreshing state... [id=2b920771-b2b2-4ab2-9577-53c8354fa058]
aws_iam_role_policy_attachment.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_lambda-code-deploy_code-deploy-policy-attachment_2AFCAC87: Refreshing state... [id=SendGridData-Dev-ApiGateway-CodeDeployRole-20240110231530761400000004]
aws_s3_bucket_public_access_block.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_code-bucket-public-access-block_8F10AA5A: Refreshing state... [id=pocket-sendgriddata-dev-apigateway]
aws_s3_bucket_ownership_controls.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_code-bucket-ownership-controls_C7E7E6F1: Refreshing state... [id=pocket-sendgriddata-dev-apigateway]
aws_iam_role_policy_attachment.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_execution-role-policy-attachment_8DF035D2: Refreshing state... [id=SendGridData-Dev-ApiGateway-ExecutionRole-20240110231530742700000003]
data.aws_route53_zone.apigateway-lambda_sendgrid-data-apigateway-lambda_base-dns_main_hosted_zone_5A756590: Read complete after 1s [id=ZCSIDA846KWLN]
aws_route53_record.apigateway-lambda_sendgrid-data-apigateway-lambda_base-dns_subhosted_zone_ns_DC05E26C: Refreshing state... [id=ZCSIDA846KWLN_sendgrid-data.getpocket.dev_NS]
aws_s3_bucket_acl.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_code-bucket-acl_34517214: Refreshing state... [id=pocket-sendgriddata-dev-apigateway,private]
aws_acm_certificate_validation.apigateway-lambda_sendgrid-data-apigateway-lambda_api-gateway-certificate_certificate_validation_24F8D637: Refreshing state... [id=2024-01-10 23:16:48.37 +0000 UTC]
aws_api_gateway_domain_name.apigateway-lambda_sendgrid-data-apigateway-lambda_api-gateway-domain-name_30FE02A4: Refreshing state... [id=sendgrid-data.getpocket.dev]
aws_route53_record.apigateway-lambda_sendgrid-data-apigateway-lambda_apigateway-route53-domain-record_997C8CE4: Refreshing state... [id=Z087040334NE8PGMB8N3C_sendgrid-data.getpocket.dev_A]
data.aws_vpc.pocket-shared-vpc_405D247E: Read complete after 0s [id=vpc-012481e83ffa5e152]
data.aws_security_groups.pocket-shared-vpc_internal_security_groups_1EABF33F: Reading...
data.aws_security_groups.pocket-shared-vpc_default_security_groups_27768768: Reading...
data.aws_subnets.pocket-shared-vpc_public_subnet_ids_D97DEFAB: Reading...
data.aws_subnets.pocket-shared-vpc_private_subnet_ids_8E7435AC: Reading...
data.aws_subnets.pocket-shared-vpc_private_subnet_ids_8E7435AC: Read complete after 0s [id=us-east-1]
data.aws_subnets.pocket-shared-vpc_public_subnet_ids_D97DEFAB: Read complete after 0s [id=us-east-1]
data.aws_security_groups.pocket-shared-vpc_default_security_groups_27768768: Read complete after 0s [id=us-east-1]
data.aws_security_groups.pocket-shared-vpc_internal_security_groups_1EABF33F: Read complete after 0s [id=us-east-1]
aws_lambda_function.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_EC760476: Refreshing state... [id=SendGridData-Dev-ApiGateway-Function]
aws_cloudwatch_log_group.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_log-group_EB81EF26: Refreshing state... [id=/aws/lambda/SendGridData-Dev-ApiGateway-Function]
aws_lambda_alias.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_alias_C748F79F: Refreshing state... [id=arn:aws:lambda:us-east-1:410318598490:function:SendGridData-Dev-ApiGateway-Function:DEPLOYED]
aws_api_gateway_integration.apigateway-lambda_sendgrid-data-apigateway-lambda_events-integration_B8DFA884: Refreshing state... [id=agi-yz6x5li9y0-r0dngj-POST]
aws_api_gateway_deployment.apigateway-lambda_api-gateway-deployment_3AF9B512: Refreshing state... [id=3opj45]
aws_api_gateway_stage.apigateway-lambda_api-gateway-stage_E95B0DF9: Refreshing state... [id=ags-yz6x5li9y0-dev]
aws_api_gateway_base_path_mapping.apigateway-lambda_sendgrid-data-apigateway-lambda_api-gateway-base-path-mapping_E12C6422: Refreshing state... [id=sendgrid-data.getpocket.dev/]
aws_lambda_permission.apigateway-lambda_sendgrid-data-apigateway-lambda_apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_alias_C748F79F-allow-gateway-lambda-invoke_3CDE9309: Refreshing state... [id=terraform-20240110231546778900000005]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_api_gateway_deployment.apigateway-lambda_api-gateway-deployment_3AF9B512 must be replaced
+/- resource "aws_api_gateway_deployment" "apigateway-lambda_api-gateway-deployment_3AF9B512" {
      ~ created_date  = "2024-01-19T14:05:15Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:us-east-1:410318598490:yz6x5li9y0/" -> (known after apply)
      ~ id            = "3opj45" -> (known after apply)
      ~ invoke_url    = "https://yz6x5li9y0.execute-api.us-east-1.amazonaws.com/" -> (known after apply)
      ~ triggers      = { # forces replacement
          ~ "deployedAt"   = "1705673080900" -> "1705673341127"
            # (1 unchanged element hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_stage.apigateway-lambda_api-gateway-stage_E95B0DF9 will be updated in-place
  ~ resource "aws_api_gateway_stage" "apigateway-lambda_api-gateway-stage_E95B0DF9" {
      ~ deployment_id         = "3opj45" -> (known after apply)
        id                    = "ags-yz6x5li9y0-dev"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
aws_api_gateway_deployment.apigateway-lambda_api-gateway-deployment_3AF9B512: Creating...
aws_api_gateway_deployment.apigateway-lambda_api-gateway-deployment_3AF9B512: Creation complete after 0s [id=q5q7rb]
aws_api_gateway_stage.apigateway-lambda_api-gateway-stage_E95B0DF9: Modifying... [id=ags-yz6x5li9y0-dev]
aws_api_gateway_stage.apigateway-lambda_api-gateway-stage_E95B0DF9: Modifications complete after 1s [id=ags-yz6x5li9y0-dev]
aws_api_gateway_deployment.apigateway-lambda_api-gateway-deployment_3AF9B512 (deposed object fb1b7607): Destroying... [id=3opj45]
aws_api_gateway_deployment.apigateway-lambda_api-gateway-deployment_3AF9B512: Destruction complete after 0s

Apply complete! Resources: 1 added, 1 changed, 1 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobID":"dc6197a1-065e-4ac0-8005-74d9390ab66e","JobName":"sendgrid-data_infrastructure_apply_dev","PRNumber":82,"Program":"tfcmt","SHA1":"e89aea084d6036f7449387bc832f439fe569b610","Target":"sendgrid-data-cdk-dev","Vars":{}} -->